espressif/esp-idf/components/soc/esp32s3/include/soc/interrupt_core0_struct.h
// Copyright 2017-2021 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_INTERRUPT_CORE0_STRUCT_H_
#define _SOC_INTERRUPT_CORE0_STRUCT_H_
#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

typedef volatile struct {
    union {
        struct {
            uint32_t core0_mac_intr_map: 5;
            uint32_t reserved5:         27;
        };
        uint32_t val;
    } core0_mac_intr_map;
    union {
        struct {
            uint32_t core0_mac_nmi_map: 5;
            uint32_t reserved5:        27;
        };
        uint32_t val;
    } core0_mac_nmi_map;
    union {
        struct {
            uint32_t core0_pwr_intr_map: 5;
            uint32_t reserved5:         27;
        };
        uint32_t val;
    } core0_pwr_intr_map;
    union {
        struct {
            uint32_t core0_bb_int_map: 5;
            uint32_t reserved5:       27;
        };
        uint32_t val;
    } core0_bb_int_map;
    union {
        struct {
            uint32_t core0_bt_mac_int_map: 5;
            uint32_t reserved5:           27;
        };
        uint32_t val;
    } core0_bt_mac_int_map;
    union {
        struct {
            uint32_t core0_bt_bb_int_map: 5;
            uint32_t reserved5:          27;
        };
        uint32_t val;
    } core0_bt_bb_int_map;
    union {
        struct {
            uint32_t core0_bt_bb_nmi_map: 5;
            uint32_t reserved5:          27;
        };
        uint32_t val;
    } core0_bt_bb_nmi_map;
    union {
        struct {
            uint32_t core0_rwbt_irq_map: 5;
            uint32_t reserved5:         27;
        };
        uint32_t val;
    } core0_rwbt_irq_map;
    union {
        struct {
            uint32_t core0_rwble_irq_map: 5;
            uint32_t reserved5:          27;
        };
        uint32_t val;
    } core0_rwble_irq_map;
    union {
        struct {
            uint32_t core0_rwbt_nmi_map: 5;
            uint32_t reserved5:         27;
        };
        uint32_t val;
    } core0_rwbt_nmi_map;
    union {
        struct {
            uint32_t core0_rwble_nmi_map: 5;
            uint32_t reserved5:          27;
        };
        uint32_t val;
    } core0_rwble_nmi_map;
    union {
        struct {
            uint32_t core0_i2c_mst_int_map: 5;
            uint32_t reserved5:            27;
        };
        uint32_t val;
    } core0_i2c_mst_int_map;
    union {
        struct {
            uint32_t core0_slc0_intr_map: 5;
            uint32_t reserved5:          27;
        };
        uint32_t val;
    } core0_slc0_intr_map;
    union {
        struct {
            uint32_t core0_slc1_intr_map: 5;
            uint32_t reserved5:          27;
        };
        uint32_t val;
    } core0_slc1_intr_map;
    union {
        struct {
            uint32_t core0_uhci0_intr_map: 5;
            uint32_t reserved5:           27;
        };
        uint32_t val;
    } core0_uhci0_intr_map;
    union {
        struct {
            uint32_t core0_uhci1_intr_map: 5;
            uint32_t reserved5:           27;
        };
        uint32_t val;
    } core0_uhci1_intr_map;
    union {
        struct {
            uint32_t core0_gpio_interrupt_pro_map: 5;
            uint32_t reserved5:                   27;
        };
        uint32_t val;
    } core0_gpio_interrupt_pro_map;
    union {
        struct {
            uint32_t core0_gpio_interrupt_pro_nmi_map: 5;
            uint32_t reserved5:                       27;
        };
        uint32_t val;
    } core0_gpio_interrupt_pro_nmi_map;
    union {
        struct {
            uint32_t core0_gpio_interrupt_app_map: 5;
            uint32_t reserved5:                   27;
        };
        uint32_t val;
    } core0_gpio_interrupt_app_map;
    union {
        struct {
            uint32_t core0_gpio_interrupt_app_nmi_map: 5;
            uint32_t reserved5:                       27;
        };
        uint32_t val;
    } core0_gpio_interrupt_app_nmi_map;
    union {
        struct {
            uint32_t core0_spi_intr_1_map: 5;
            uint32_t reserved5:           27;
        };
        uint32_t val;
    } core0_spi_intr_1_map;
    union {
        struct {
            uint32_t core0_spi_intr_2_map: 5;
            uint32_t reserved5:           27;
        };
        uint32_t val;
    } core0_spi_intr_2_map;
    union {
        struct {
            uint32_t core0_spi_intr_3_map: 5;
            uint32_t reserved5:           27;
        };
        uint32_t val;
    } core0_spi_intr_3_map;
    union {
        struct {
            uint32_t core0_spi_intr_4_map: 5;
            uint32_t reserved5:           27;
        };
        uint32_t val;
    } core0_spi_intr_4_map;
    union {
        struct {
            uint32_t core0_lcd_cam_int_map: 5;
            uint32_t reserved5:            27;
        };
        uint32_t val;
    } core0_lcd_cam_int_map;
    union {
        struct {
            uint32_t core0_i2s0_int_map: 5;
            uint32_t reserved5:         27;
        };
        uint32_t val;
    } core0_i2s0_int_map;
    union {
        struct {
            uint32_t core0_i2s1_int_map: 5;
            uint32_t reserved5:         27;
        };
        uint32_t val;
    } core0_i2s1_int_map;
    union {
        struct {
            uint32_t core0_uart_intr_map: 5;
            uint32_t reserved5:          27;
        };
        uint32_t val;
    } core0_uart_intr_map;
    union {
        struct {
            uint32_t core0_uart1_intr_map: 5;
            uint32_t reserved5:           27;
        };
        uint32_t val;
    } core0_uart1_intr_map;
    union {
        struct {
            uint32_t core0_uart2_intr_map: 5;
            uint32_t reserved5:           27;
        };
        uint32_t val;
    } core0_uart2_intr_map;
    union {
        struct {
            uint32_t core0_sdio_host_interrupt_map: 5;
            uint32_t reserved5:                    27;
        };
        uint32_t val;
    } core0_sdio_host_interrupt_map;
    union {
        struct {
            uint32_t core0_pwm0_intr_map: 5;
            uint32_t reserved5:          27;
        };
        uint32_t val;
    } core0_pwm0_intr_map;
    union {
        struct {
            uint32_t core0_pwm1_intr_map: 5;
            uint32_t reserved5:          27;
        };
        uint32_t val;
    } core0_pwm1_intr_map;
    union {
        struct {
            uint32_t core0_pwm2_intr_map: 5;
            uint32_t reserved5:          27;
        };
        uint32_t val;
    } core0_pwm2_intr_map;
    union {
        struct {
            uint32_t core0_pwm3_intr_map: 5;
            uint32_t reserved5:          27;
        };
        uint32_t val;
    } core0_pwm3_intr_map;
    union {
        struct {
            uint32_t core0_ledc_int_map: 5;
            uint32_t reserved5:         27;
        };
        uint32_t val;
    } core0_ledc_int_map;
    union {
        struct {
            uint32_t core0_efuse_int_map: 5;
            uint32_t reserved5:          27;
        };
        uint32_t val;
    } core0_efuse_int_map;
    union {
        struct {
            uint32_t core0_can_int_map: 5;
            uint32_t reserved5:        27;
        };
        uint32_t val;
    } core0_can_int_map;
    union {
        struct {
            uint32_t core0_usb_intr_map: 5;
            uint32_t reserved5:         27;
        };
        uint32_t val;
    } core0_usb_intr_map;
    union {
        struct {
            uint32_t core0_rtc_core_intr_map: 5;
            uint32_t reserved5:              27;
        };
        uint32_t val;
    } core0_rtc_core_intr_map;
    union {
        struct {
            uint32_t core0_rmt_intr_map: 5;
            uint32_t reserved5:         27;
        };
        uint32_t val;
    } core0_rmt_intr_map;
    union {
        struct {
            uint32_t core0_pcnt_intr_map: 5;
            uint32_t reserved5:          27;
        };
        uint32_t val;
    } core0_pcnt_intr_map;
    union {
        struct {
            uint32_t core0_i2c_ext0_intr_map: 5;
            uint32_t reserved5:              27;
        };
        uint32_t val;
    } core0_i2c_ext0_intr_map;
    union {
        struct {
            uint32_t core0_i2c_ext1_intr_map: 5;
            uint32_t reserved5:              27;
        };
        uint32_t val;
    } core0_i2c_ext1_intr_map;
    union {
        struct {
            uint32_t core0_spi2_dma_int_map: 5;
            uint32_t reserved5:             27;
        };
        uint32_t val;
    } core0_spi2_dma_int_map;
    union {
        struct {
            uint32_t core0_spi3_dma_int_map: 5;
            uint32_t reserved5:             27;
        };
        uint32_t val;
    } core0_spi3_dma_int_map;
    union {
        struct {
            uint32_t core0_spi4_dma_int_map: 5;
            uint32_t reserved5:             27;
        };
        uint32_t val;
    } core0_spi4_dma_int_map;
    union {
        struct {
            uint32_t core0_wdg_int_map: 5;
            uint32_t reserved5:        27;
        };
        uint32_t val;
    } core0_wdg_int_map;
    union {
        struct {
            uint32_t core0_timer_int1_map: 5;
            uint32_t reserved5:           27;
        };
        uint32_t val;
    } core0_timer_int1_map;
    union {
        struct {
            uint32_t core0_timer_int2_map: 5;
            uint32_t reserved5:           27;
        };
        uint32_t val;
    } core0_timer_int2_map;
    union {
        struct {
            uint32_t core0_tg_t0_int_map: 5;
            uint32_t reserved5:          27;
        };
        uint32_t val;
    } core0_tg_t0_int_map;
    union {
        struct {
            uint32_t core0_tg_t1_int_map: 5;
            uint32_t reserved5:          27;
        };
        uint32_t val;
    } core0_tg_t1_int_map;
    union {
        struct {
            uint32_t core0_tg_wdt_int_map: 5;
            uint32_t reserved5:           27;
        };
        uint32_t val;
    } core0_tg_wdt_int_map;
    union {
        struct {
            uint32_t core0_tg1_t0_int_map: 5;
            uint32_t reserved5:           27;
        };
        uint32_t val;
    } core0_tg1_t0_int_map;
    union {
        struct {
            uint32_t core0_tg1_t1_int_map: 5;
            uint32_t reserved5:           27;
        };
        uint32_t val;
    } core0_tg1_t1_int_map;
    union {
        struct {
            uint32_t core0_tg1_wdt_int_map: 5;
            uint32_t reserved5:            27;
        };
        uint32_t val;
    } core0_tg1_wdt_int_map;
    union {
        struct {
            uint32_t core0_cache_ia_int_map: 5;
            uint32_t reserved5:             27;
        };
        uint32_t val;
    } core0_cache_ia_int_map;
    union {
        struct {
            uint32_t core0_systimer_target0_int_map: 5;
            uint32_t reserved5:                     27;
        };
        uint32_t val;
    } core0_systimer_target0_int_map;
    union {
        struct {
            uint32_t core0_systimer_target1_int_map: 5;
            uint32_t reserved5:                     27;
        };
        uint32_t val;
    } core0_systimer_target1_int_map;
    union {
        struct {
            uint32_t core0_systimer_target2_int_map: 5;
            uint32_t reserved5:                     27;
        };
        uint32_t val;
    } core0_systimer_target2_int_map;
    union {
        struct {
            uint32_t core0_spi_mem_reject_intr_map: 5;
            uint32_t reserved5:                    27;
        };
        uint32_t val;
    } core0_spi_mem_reject_intr_map;
    union {
        struct {
            uint32_t core0_dcache_preload_int_map: 5;
            uint32_t reserved5:                   27;
        };
        uint32_t val;
    } core0_dcache_preload_int_map;
    union {
        struct {
            uint32_t core0_icache_preload_int_map: 5;
            uint32_t reserved5:                   27;
        };
        uint32_t val;
    } core0_icache_preload_int_map;
    union {
        struct {
            uint32_t core0_dcache_sync_int_map: 5;
            uint32_t reserved5:                27;
        };
        uint32_t val;
    } core0_dcache_sync_int_map;
    union {
        struct {
            uint32_t core0_icache_sync_int_map: 5;
            uint32_t reserved5:                27;
        };
        uint32_t val;
    } core0_icache_sync_int_map;
    union {
        struct {
            uint32_t core0_apb_adc_int_map: 5;
            uint32_t reserved5:            27;
        };
        uint32_t val;
    } core0_apb_adc_int_map;
    union {
        struct {
            uint32_t core0_dma_in_ch0_int_map: 5;
            uint32_t reserved5:               27;
        };
        uint32_t val;
    } core0_dma_in_ch0_int_map;
    union {
        struct {
            uint32_t core0_dma_in_ch1_int_map: 5;
            uint32_t reserved5:               27;
        };
        uint32_t val;
    } core0_dma_in_ch1_int_map;
    union {
        struct {
            uint32_t core0_dma_in_ch2_int_map: 5;
            uint32_t reserved5:               27;
        };
        uint32_t val;
    } core0_dma_in_ch2_int_map;
    union {
        struct {
            uint32_t core0_dma_in_ch3_int_map: 5;
            uint32_t reserved5:               27;
        };
        uint32_t val;
    } core0_dma_in_ch3_int_map;
    union {
        struct {
            uint32_t core0_dma_in_ch4_int_map: 5;
            uint32_t reserved5:               27;
        };
        uint32_t val;
    } core0_dma_in_ch4_int_map;
    union {
        struct {
            uint32_t core0_dma_out_ch0_int_map: 5;
            uint32_t reserved5:                27;
        };
        uint32_t val;
    } core0_dma_out_ch0_int_map;
    union {
        struct {
            uint32_t core0_dma_out_ch1_int_map: 5;
            uint32_t reserved5:                27;
        };
        uint32_t val;
    } core0_dma_out_ch1_int_map;
    union {
        struct {
            uint32_t core0_dma_out_ch2_int_map: 5;
            uint32_t reserved5:                27;
        };
        uint32_t val;
    } core0_dma_out_ch2_int_map;
    union {
        struct {
            uint32_t core0_dma_out_ch3_int_map: 5;
            uint32_t reserved5:                27;
        };
        uint32_t val;
    } core0_dma_out_ch3_int_map;
    union {
        struct {
            uint32_t core0_dma_out_ch4_int_map: 5;
            uint32_t reserved5:                27;
        };
        uint32_t val;
    } core0_dma_out_ch4_int_map;
    union {
        struct {
            uint32_t core0_rsa_int_map: 5;
            uint32_t reserved5:        27;
        };
        uint32_t val;
    } core0_rsa_int_map;
    union {
        struct {
            uint32_t core0_aes_int_map: 5;
            uint32_t reserved5:        27;
        };
        uint32_t val;
    } core0_aes_int_map;
    union {
        struct {
            uint32_t core0_sha_int_map: 5;
            uint32_t reserved5:        27;
        };
        uint32_t val;
    } core0_sha_int_map;
    union {
        struct {
            uint32_t core0_cpu_intr_from_cpu_0_map: 5;
            uint32_t reserved5:                    27;
        };
        uint32_t val;
    } core0_cpu_intr_from_cpu_0_map;
    union {
        struct {
            uint32_t core0_cpu_intr_from_cpu_1_map: 5;
            uint32_t reserved5:                    27;
        };
        uint32_t val;
    } core0_cpu_intr_from_cpu_1_map;
    union {
        struct {
            uint32_t core0_cpu_intr_from_cpu_2_map: 5;
            uint32_t reserved5:                    27;
        };
        uint32_t val;
    } core0_cpu_intr_from_cpu_2_map;
    union {
        struct {
            uint32_t core0_cpu_intr_from_cpu_3_map: 5;
            uint32_t reserved5:                    27;
        };
        uint32_t val;
    } core0_cpu_intr_from_cpu_3_map;
    union {
        struct {
            uint32_t core0_assist_debug_intr_map: 5;
            uint32_t reserved5:                  27;
        };
        uint32_t val;
    } core0_assist_debug_intr_map;
    union {
        struct {
            uint32_t core0_dma_apbperi_pms_monitor_violate_intr_map: 5;
            uint32_t reserved5:                                     27;
        };
        uint32_t val;
    } core0_dma_apbperi_pms_monitor_violate_intr_map;
    union {
        struct {
            uint32_t core0_core_0_iram0_pms_monitor_violate_intr_map: 5;
            uint32_t reserved5:                                      27;
        };
        uint32_t val;
    } core0_core_0_iram0_pms_monitor_violate_intr_map;
    union {
        struct {
            uint32_t core0_core_0_dram0_pms_monitor_violate_intr_map: 5;
            uint32_t reserved5:                                      27;
        };
        uint32_t val;
    } core0_core_0_dram0_pms_monitor_violate_intr_map;
    union {
        struct {
            uint32_t core0_core_0_pif_pms_monitor_violate_intr_map: 5;
            uint32_t reserved5:                                    27;
        };
        uint32_t val;
    } core0_core_0_pif_pms_monitor_violate_intr_map;
    union {
        struct {
            uint32_t core0_core_0_pif_pms_monitor_violate_size_intr_map: 5;
            uint32_t reserved5:                                         27;
        };
        uint32_t val;
    } core0_core_0_pif_pms_monitor_violate_size_intr_map;
    union {
        struct {
            uint32_t core0_core_1_iram0_pms_monitor_violate_intr_map: 5;
            uint32_t reserved5:                                      27;
        };
        uint32_t val;
    } core0_core_1_iram0_pms_monitor_violate_intr_map;
    union {
        struct {
            uint32_t core0_core_1_dram0_pms_monitor_violate_intr_map: 5;
            uint32_t reserved5:                                      27;
        };
        uint32_t val;
    } core0_core_1_dram0_pms_monitor_violate_intr_map;
    union {
        struct {
            uint32_t core0_core_1_pif_pms_monitor_violate_intr_map: 5;
            uint32_t reserved5:                                    27;
        };
        uint32_t val;
    } core0_core_1_pif_pms_monitor_violate_intr_map;
    union {
        struct {
            uint32_t core0_core_1_pif_pms_monitor_violate_size_intr_map: 5;
            uint32_t reserved5:                                         27;
        };
        uint32_t val;
    } core0_core_1_pif_pms_monitor_violate_size_intr_map;
    union {
        struct {
            uint32_t core0_backup_pms_violate_intr_map: 5;
            uint32_t reserved5:                        27;
        };
        uint32_t val;
    } core0_backup_pms_violate_intr_map;
    union {
        struct {
            uint32_t core0_cache_core0_acs_int_map: 5;
            uint32_t reserved5:                    27;
        };
        uint32_t val;
    } core0_cache_core0_acs_int_map;
    union {
        struct {
            uint32_t core0_cache_core1_acs_int_map: 5;
            uint32_t reserved5:                    27;
        };
        uint32_t val;
    } core0_cache_core1_acs_int_map;
    union {
        struct {
            uint32_t core0_usb_device_int_map: 5;
            uint32_t reserved5:               27;
        };
        uint32_t val;
    } core0_usb_device_int_map;
    union {
        struct {
            uint32_t core0_peri_backup_int_map: 5;
            uint32_t reserved5:                27;
        };
        uint32_t val;
    } core0_peri_backup_int_map;
    union {
        struct {
            uint32_t core0_dma_extmem_reject_int_map: 5;
            uint32_t reserved5:                      27;
        };
        uint32_t val;
    } core0_dma_extmem_reject_int_map;
    uint32_t core0_intr_status_0;                                             /**/
    uint32_t core0_intr_status_1;                                             /**/
    uint32_t core0_intr_status_2;                                             /**/
    uint32_t core0_intr_status_3;                                             /**/
    union {
        struct {
            uint32_t core0_clk_en: 1;
            uint32_t reserved1:   31;
        };
        uint32_t val;
    } core0_clock_gate;
    uint32_t reserved_1a0;
    uint32_t reserved_1a4;
    uint32_t reserved_1a8;
    uint32_t reserved_1ac;
    uint32_t reserved_1b0;
    uint32_t reserved_1b4;
    uint32_t reserved_1b8;
    uint32_t reserved_1bc;
    uint32_t reserved_1c0;
    uint32_t reserved_1c4;
    uint32_t reserved_1c8;
    uint32_t reserved_1cc;
    uint32_t reserved_1d0;
    uint32_t reserved_1d4;
    uint32_t reserved_1d8;
    uint32_t reserved_1dc;
    uint32_t reserved_1e0;
    uint32_t reserved_1e4;
    uint32_t reserved_1e8;
    uint32_t reserved_1ec;
    uint32_t reserved_1f0;
    uint32_t reserved_1f4;
    uint32_t reserved_1f8;
    uint32_t reserved_1fc;
    uint32_t reserved_200;
    uint32_t reserved_204;
    uint32_t reserved_208;
    uint32_t reserved_20c;
    uint32_t reserved_210;
    uint32_t reserved_214;
    uint32_t reserved_218;
    uint32_t reserved_21c;
    uint32_t reserved_220;
    uint32_t reserved_224;
    uint32_t reserved_228;
    uint32_t reserved_22c;
    uint32_t reserved_230;
    uint32_t reserved_234;
    uint32_t reserved_238;
    uint32_t reserved_23c;
    uint32_t reserved_240;
    uint32_t reserved_244;
    uint32_t reserved_248;
    uint32_t reserved_24c;
    uint32_t reserved_250;
    uint32_t reserved_254;
    uint32_t reserved_258;
    uint32_t reserved_25c;
    uint32_t reserved_260;
    uint32_t reserved_264;
    uint32_t reserved_268;
    uint32_t reserved_26c;
    uint32_t reserved_270;
    uint32_t reserved_274;
    uint32_t reserved_278;
    uint32_t reserved_27c;
    uint32_t reserved_280;
    uint32_t reserved_284;
    uint32_t reserved_288;
    uint32_t reserved_28c;
    uint32_t reserved_290;
    uint32_t reserved_294;
    uint32_t reserved_298;
    uint32_t reserved_29c;
    uint32_t reserved_2a0;
    uint32_t reserved_2a4;
    uint32_t reserved_2a8;
    uint32_t reserved_2ac;
    uint32_t reserved_2b0;
    uint32_t reserved_2b4;
    uint32_t reserved_2b8;
    uint32_t reserved_2bc;
    uint32_t reserved_2c0;
    uint32_t reserved_2c4;
    uint32_t reserved_2c8;
    uint32_t reserved_2cc;
    uint32_t reserved_2d0;
    uint32_t reserved_2d4;
    uint32_t reserved_2d8;
    uint32_t reserved_2dc;
    uint32_t reserved_2e0;
    uint32_t reserved_2e4;
    uint32_t reserved_2e8;
    uint32_t reserved_2ec;
    uint32_t reserved_2f0;
    uint32_t reserved_2f4;
    uint32_t reserved_2f8;
    uint32_t reserved_2fc;
    uint32_t reserved_300;
    uint32_t reserved_304;
    uint32_t reserved_308;
    uint32_t reserved_30c;
    uint32_t reserved_310;
    uint32_t reserved_314;
    uint32_t reserved_318;
    uint32_t reserved_31c;
    uint32_t reserved_320;
    uint32_t reserved_324;
    uint32_t reserved_328;
    uint32_t reserved_32c;
    uint32_t reserved_330;
    uint32_t reserved_334;
    uint32_t reserved_338;
    uint32_t reserved_33c;
    uint32_t reserved_340;
    uint32_t reserved_344;
    uint32_t reserved_348;
    uint32_t reserved_34c;
    uint32_t reserved_350;
    uint32_t reserved_354;
    uint32_t reserved_358;
    uint32_t reserved_35c;
    uint32_t reserved_360;
    uint32_t reserved_364;
    uint32_t reserved_368;
    uint32_t reserved_36c;
    uint32_t reserved_370;
    uint32_t reserved_374;
    uint32_t reserved_378;
    uint32_t reserved_37c;
    uint32_t reserved_380;
    uint32_t reserved_384;
